import { Lawcase, Person } from "./type"

export const casePerson: Person[] = [
    {
        id: 1,
        name: '肖玉新',
        personNumber: '37088219960324581X',
        gender: '男',
        address: '山东省兖州市小孟镇肖家王村247号',
        tel: '15020745337',
        marriage: '未婚',
        nation: '汉族',
        photoUrl: '../assets/1.jpg',
        sue: '帮信'
    },
    { id: 2, name: '解世超', personNumber: '130130199512023331', gender: '男', address: '河北省石家庄市无极县郝庄乡东门营村文明街东20号', tel: '15020745337', marriage: '已婚', nation: '汉族', photoUrl: 'assets/2.jpg', sue: '掩饰隐瞒犯罪所得' },
    { id: 3, name: '严雪烽', personNumber: '522222199312163233', gender: '男', address: '贵州省江口县怒溪乡梵星村五组', tel: '15020745337', marriage: '未婚', nation: '土家族', photoUrl: 'assets/4.jpg', sue: '掩饰隐瞒犯罪所得' },
    {
        id: 4, name: '谢国辉',
        personNumber: '511121197808104815',
        gender: '男',
        address: '四川省仁寿县禄加镇光华社区8组28号',
        tel: '15020745337',
        marriage: '未婚',
        nation: '汉族',
        photoUrl: 'assets/3.jpg',
        sue: '掩饰隐瞒犯罪所得',
        criminalRecord: '涉嫌抢劫于 20020530被富加刑警中队采取刑事强制措施；涉嫌演示隐瞒犯罪所得20220628被四川省仁寿县公安局立案侦查。'
    }
]

export const personAccount = {
    1: [
        { id: 1, account: '6236433001344600357', company: '中国建设银行股份有限公司上海长三角一体化示范区支行', createDate: '2023-01-03', remark: '该卡为涉案一级卡6217002210024971753的二级洗钱账户', amount: '' },
        { id: 2, account: '6217856000065432527', company: '中国银行兖州西环支行', createDate: '2017-03-08', remark: '该卡为涉案一级卡6217002210024971753的三级洗钱账户', amount: '' },
        { id: 3, account: '6217002210024971753', company: '中国建设银行股份有限公司济宁兖州支行', createDate: '2018-03-27', remark: '', amount: '89.35万' }
    ],
    2: [
        { id: 4, account: '6214130050005144406', company: '无极支行', createDate: '2022-12-26', remark: '本案一级卡嫌疑人肖玉新37088219960324581X将受害人资金转入该解账户，后解世超于20230104 13:45:44取现64万', amount: '' },
        { id: 5, account: '6214833111063536', company: '石家庄分行裕华支行', createDate: '2018-06-27', remark: '该卡为梅伟被诈骗案A4403115900002022126426三级账户（一级卡刘建伟6217995020014098429），最终将卡内资金全部取现，取现金额50万元，取现地点：20221231125638石家庄分行营业部。', amount: '' }
    ],
    3: [
        { id: 6, account: '6228234095036045564', company: '中国农业银行股份有限公司仁寿禄加分理处', createDate: '2013-05-22', remark: '本案受害人资金2万元于20230104 142736取现2万元，地点中国农业银行股份有限公司仁寿金兰支行', amount: '5.5万' },
        { id: 7, account: '6214571281008188670 ', company: '四川仁寿农村商业银行股份有限公司鹤鸣分理处', createDate: '2021-08-26', remark: '涉案一级账户何玉龙6217996610003408677于2022-06-13 15：06转入二级账户谢国辉6214571281008188670资金26000元，受害人资金流转过程中此卡多次出现，此卡明细存在多案受害者资金。', amount: '' },
        { id: 8, account: '6228484099133820678 ', company: '中国农业银行股份有限公司仁寿禄加分理处', createDate: '2015-04-06', remark: '后于20220520 130223 柜台取现4.5万，地点中国农业银行股份有限公司仁寿文林支行。\n其中，谢国辉银行卡6214571281008188670、6228484099133820678因掩饰隐瞒被四川省仁寿县公安局	处理，6228234095036045564于2023.1.4再次涉案。', amount: '4.5w' }
    ],
    4: [
        { id: 9, account: '6228481198898223277 ', company: '中国农业银行股份有限公司铜仁锦江支行', createDate: '2018-09-30', remark: '该卡取现金额2.5万元。', amount: '' },
        { id: 10, account: '6217995840048597165 ', company: '中国邮政储蓄银行股份有限公司深圳源盛营业所', createDate: '2016-11-23', remark: '该卡为6228481198898223277二级账户，取款金额1万元。', amount: '' }
    ]
}

export const accountLawcases = {
    1: [
        { caseName: '胡国军被诈骗案', caseId: 'A1509280500002023010002' },
        { caseName: '刘青峰被诈骗案', caseId: 'A3201128400002023010008' },
        { caseName: '周丽云被诈骗案', caseId: 'A3206825600002023010017' },
        { caseName: '吴畏被诈骗案', caseId: 'A3210025300002023010009' },
        { caseName: '南浔区南浔镇徐云峰被诈骗案', caseId: 'A3305035000002023015011' },
        { caseName: '越城区何伟被诈骗案', caseId: 'A3306025500002023015009' },
        { caseName: '邓十匀被诈骗案', caseId: 'A4403115200002023016036' }
    ],
    5:[
        { caseName: '梅伟被诈骗案', caseId: 'A4403115900002022126426' }
    ],
    6: [
        { caseName: '福泉市娄梅被诈骗案', caseId: 'A5227026200002023010002' }
    ],
    7: [
        { caseName: '燕红军被诈骗案', caseId: 'A32050655000020220500CB' },
        { caseName: '韩勇芳被诈骗案二级账户', caseId: 'A5134220900002022050007' },
        { caseName: '滕红梅被诈骗案二级账户', caseId: 'A320923050000201904000D' },
    ],
    8:[
        { caseName: '韩勇芳被诈骗案二级账户', caseId: 'A5134220900002022050007' },
        { caseName: '燕红军被诈骗案二级账户', caseId: 'A6208210500002022050025' },
        { caseName: '畅明安被诈骗案二级账户', caseId: 'A32050655000020220500CB' },

    ],
    9: [{ caseName: '王林芬被诈骗', caseId: 'A5303225600002023010016' }],
    10: [{ caseName: '王林芬被诈骗', caseId: 'A5303225600002023010016' }]
}

export const mainCase: Lawcase = {
    caseId: 'A5134220900002022050007',
    caseName: '姜志佳被诈骗案',
    caseDesc: '2023年1月3日姜志佳收到一条号码10690154739057381596发来的短信，显示是信用卡中心发来的，内容为民生银行信用分已达标，预批的信用额度为126000元，申领填表单链接coloursc.cn/fr，然后姜志佳就点击链接下载民生e贷APP，并注册账号，绑定收款银行卡，然后姜志佳就在APP上面申请贷款，之后姜志佳准备提现，系统提示收款银行卡号输错一位，贷款资金被冻结，对方让姜志佳向指定银行卡转账进行解冻，姜志佳转账后，对方又说姜志佳没有听指挥资金被二次冻结，还让姜志佳转账，对方以各种名义让姜志佳转账。之后发现被骗报警。'
}
